; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v4 - type_3 ?v1 - type_1)
 	      (pred_3 ?v8 - object ?v1 - type_1)
	      (pred_4 ?v4 - type_3 ?v2 - type_2)
	      (pred_1 ?v4 - type_3 ?v8 - object ?v2 - type_2))

   (:action op_1
       :parameters  (?v4 - type_3 ?v3 ?v5 - type_1)
       :precondition (and  (pred_2 ?v4 ?v3))
       :effect (and  (pred_2 ?v4 ?v5)
		     (not (pred_2 ?v4 ?v3))))

   (:action op_2
       :parameters (?v4 - type_3 ?v7 - object ?v6 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v6) (pred_2 ?v4 ?v6) (pred_4 ?v4 ?v2))
       :effect (and (pred_1 ?v4 ?v7 ?v2)
		    (not (pred_3 ?v7 ?v6)) 
		    (not (pred_4 ?v4 ?v2))))

   (:action op_3
       :parameters (?v4 - type_3 ?v7 - object ?v6 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v7 ?v2) (pred_2 ?v4 ?v6))
       :effect (and (pred_3 ?v7 ?v6)
		    (pred_4 ?v4 ?v2)
		    (not (pred_1 ?v4 ?v7 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_3
obj_04 obj_08 - type_2
obj_01 obj_07 obj_06 - type_1
obj_09 obj_05 obj_03 - object)
(:init
(pred_2 obj_02 obj_06)
(pred_4 obj_02 obj_04)
(pred_4 obj_02 obj_08)
(pred_3 obj_09 obj_06)
(pred_3 obj_05 obj_07)
(pred_3 obj_03 obj_07)
)
(:goal
(and
(pred_3 obj_09 obj_07)
(pred_3 obj_05 obj_01)
(pred_3 obj_03 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_02 ?b obj_08))))
)
)

; plan
1. (op_2 obj_02 obj_09 obj_06 obj_04)
   deleted: (pred_3 obj_09 obj_06) (pred_4 obj_02 obj_04)
   added: (pred_1 obj_02 obj_09 obj_04)
   goals met: 0 of 3
2. (op_1 obj_02 obj_06 obj_07)
   deleted: (pred_2 obj_02 obj_06)
   added: (pred_2 obj_02 obj_07)
   goals met: 0 of 3
3. (op_3 obj_02 obj_09 obj_07 obj_04)
   deleted: (pred_1 obj_02 obj_09 obj_04)
   added: (pred_3 obj_09 obj_07) (pred_4 obj_02 obj_04)
   goals met: 1 of 3
4. (op_2 obj_02 obj_05 obj_07 obj_04)
   deleted: (pred_3 obj_05 obj_07) (pred_4 obj_02 obj_04)
   added: (pred_1 obj_02 obj_05 obj_04)
   goals met: 1 of 3
5. (op_1 obj_02 obj_07 obj_01)
   deleted: (pred_2 obj_02 obj_07)
   added: (pred_2 obj_02 obj_01)
   goals met: 1 of 3
6. (op_3 obj_02 obj_05 obj_01 obj_04)
   deleted: (pred_1 obj_02 obj_05 obj_04)
   added: (pred_3 obj_05 obj_01) (pred_4 obj_02 obj_04)
   goals met: 2 of 3
7. (op_1 obj_02 obj_01 obj_07)
   deleted: (pred_2 obj_02 obj_01)
   added: (pred_2 obj_02 obj_07)
   goals met: 2 of 3
8. (op_2 obj_02 obj_03 obj_07 obj_04)
   deleted: (pred_3 obj_03 obj_07) (pred_4 obj_02 obj_04)
   added: (pred_1 obj_02 obj_03 obj_04)
   goals met: 2 of 3
9. (op_1 obj_02 obj_07 obj_01)
   deleted: (pred_2 obj_02 obj_07)
   added: (pred_2 obj_02 obj_01)
   goals met: 2 of 3
10. (op_3 obj_02 obj_03 obj_01 obj_04)
   deleted: (pred_1 obj_02 obj_03 obj_04)
   added: (pred_3 obj_03 obj_01) (pred_4 obj_02 obj_04)
   goals met: 3 of 3
